var rule = Object.assign(muban.mxone5,{
//模板:'mxone5',
title:'量子影视',
host:'http://www.lzizy9.com',
url:'/index.php/vod/show/id/fyclass/page/fypage.html',
searchUrl:'/index.php/vod/search.html?wd=**',
cate_exclude:'网址',

filter:{
    1: [
          {'key': 'id', 
            'name': '类型', 
            'value': [
                         {'n': '全部', 'v': '1'}, 
                         {'n': '动作片', 'v': '6'},
                         {'n': '喜剧片', 'v': '7'},
                         {'n': '科幻片', 'v': '8'},
                         {'n': '恐怖片', 'v': '9'},
                         {'n': '爱情片', 'v': '10'},
                         {'n': '剧情片', 'v': '11'},
                         {'n': '战争片', 'v': '12'},
                         {'n': '伦理片', 'v': '21'},
                         {'n': '记录片', 'v': '20'}                 
                         ]
          },
          {'key': 'a', 
            'name': '地区', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '大陆', 'v': '/area/%E5%A4%A7%E9%99%86'}, 
                         {'n': '香港', 'v': '/area/%E9%A6%99%E6%B8%AF'}, 
                         {'n': '台湾', 'v': '/area/%E5%8F%B0%E6%B9%BE'}, 
                         {'n': '美国', 'v': '/area/%E7%BE%8E%E5%9B%BD'}, 
                         {'n': '法国', 'v': '/area/%E6%B3%95%E5%9B%BD'}, 
                         {'n': '英国', 'v': '/area/%E8%8B%B1%E5%9B%BD'}, 
                         {'n': '日本', 'v': '/area/%E6%97%A5%E6%9C%AC'}, 
                         {'n': '韩国', 'v': '/area/%E9%9F%A9%E5%9B%BD'}, 
                         {'n': '德国', 'v': '/area/%E5%BE%B7%E5%9B%BD'}, 
                         {'n': '泰国', 'v': '/area/%E6%B3%B0%E5%9B%BD'}, 
                         {'n': '印度', 'v': '/area/%E5%8D%B0%E5%BA%A6'}, 
                         {'n': '意大利', 'v': '/area/%E6%84%8F%E5%A4%A7%E5%88%A9'}, 
                         {'n': '西班牙', 'v': '/area/%E8%A5%BF%E7%8F%AD%E7%89%99'}, 
                         {'n': '加拿大', 'v': '/area/%E5%8A%A0%E6%8B%BF%E5%A4%A7'}, 
                         {'n': '其他', 'v': '/area/%E5%85%B6%E4%BB%96'}
                         ] 
           },
         {'key': 'y',            
            'name': '年代', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '2022', 'v': '/year/2022'}, 
                         {'n': '2021', 'v': '/year/2021'}, 
                         {'n': '2020', 'v': '/year/2020'}, 
                         {'n': '2019', 'v': '/year/2019'}, 
                         {'n': '2018', 'v': '/year/2018'}, 
                         {'n': '2017', 'v': '/year/2017'}, 
                         {'n': '2016', 'v': '/year/2016'}, 
                         {'n': '2015', 'v': '/year/2015'}, 
                         {'n': '2014', 'v': '/year/2014'}, 
                         {'n': '2013', 'v': '/year/2013'}, 
                         {'n': '2012', 'v': '/year/2012'}, 
                         {'n': '2011', 'v': '/year/2011'}, 
                         {'n': '2000之前', 'v': '/year/lt|2000'}
                         ]
           },
          {'key': 'by', 
            'name': '排序', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '时间', 'v': '/by/time'}, 
                         {'n': '人气', 'v': '/by/hits'}, 
                         {'n': '评分', 'v': '/by/score'}
                          ]}], 
    2: [
          {'key': 'id', 
            'name': '类型', 
            'value': [
                         {'n': '全部', 'v': '2'},
                         {'n': '国产剧', 'v': '13'},
                         {'n': '欧美剧', 'v': '14'},
                         {'n': '香港剧', 'v': '15'},
                         {'n': '韩国剧', 'v': '16'},
                         {'n': '日本剧', 'v': '23'},
                         {'n': '台湾剧', 'v': '22'},
                         {'n': '泰国剧', 'v': '25'},
                         {'n': '海外剧', 'v': '24'}
                         ]
          },          
          {'key': 'a', 
            'name': '地区', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '内地', 'v': '/area/%E5%86%85%E5%9C%B0'},
                         {'n': '韩国', 'v': '/area/%E9%9F%A9%E5%9B%BD'},
                         {'n': '香港', 'v': '/area/%E9%A6%99%E6%B8%AF'},
                         {'n': '台湾', 'v': '/area/%E5%8F%B0%E6%B9%BE'},
                         {'n': '日本', 'v': '/area/%E6%97%A5%E6%9C%AC'},
                         {'n': '美国', 'v': '/area/%E7%BE%8E%E5%9B%BD'},
                         {'n': '泰国', 'v': '/area/%E6%B3%B0%E5%9B%BD'},
                         {'n': '英国', 'v': '/area/%E8%8B%B1%E5%9B%BD'},
                         {'n': '新加坡', 'v': '/area/%E6%96%B0%E5%8A%A0%E5%9D%A1'},
                         {'n': '其他', 'v': '/area/%E5%85%B6%E4%BB%96'}
                         ] 
           },
         {'key': 'y',            
            'name': '年代', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '2022', 'v': '/year/2022'}, 
                         {'n': '2021', 'v': '/year/2021'}, 
                         {'n': '2020', 'v': '/year/2020'}, 
                         {'n': '2019', 'v': '/year/2019'}, 
                         {'n': '2018', 'v': '/year/2018'}, 
                         {'n': '2017', 'v': '/year/2017'}, 
                         {'n': '2016', 'v': '/year/2016'}, 
                         {'n': '2015', 'v': '/year/2015'}, 
                         {'n': '2014', 'v': '/year/2014'}, 
                         {'n': '2013', 'v': '/year/2013'}, 
                         {'n': '2012', 'v': '/year/2012'}, 
                         {'n': '2011', 'v': '/year/2011'}, 
                         {'n': '2000之前', 'v': '/year/lt|2000'}
                         ]
           },
          {'key': 'by', 
            'name': '排序', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '时间', 'v': '/by/time'}, 
                         {'n': '人气', 'v': '/by/hits'}, 
                         {'n': '评分', 'v': '/by/score'}
                          ]}], 
	               
    3: [
          {'key': 'id', 
            'name': '类型', 
            'value': [
                         {'n': '全部', 'v': '3'},
                         {'n': '国产动漫', 'v': '26'},
                         {'n': '日韩动漫', 'v': '27'},
                         {'n': '欧美动漫', 'v': '28'},
                         {'n': '港台动漫', 'v': '29'},
                         {'n': '海外动漫', 'v': '30'}
                         ]
          },
          {'key': 'a', 
            'name': '地区', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '内地', 'v': '/area/%E5%86%85%E5%9C%B0'},
                         {'n': '港台', 'v': '/area/%E6%B8%AF%E5%8F%B0'},
                         {'n': '日韩', 'v': '/area/%E6%97%A5%E9%9F%A9'},
                         {'n': '欧美', 'v': '/area/%E6%AC%A7%E7%BE%8E'}
                         ] 
           },
           {'key': 'y',            
            'name': '年代', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '2022', 'v': '/year/2022'}, 
                         {'n': '2021', 'v': '/year/2021'}, 
                         {'n': '2020', 'v': '/year/2020'}, 
                         {'n': '2019', 'v': '/year/2019'}, 
                         {'n': '2018', 'v': '/year/2018'}, 
                         {'n': '2017', 'v': '/year/2017'}, 
                         {'n': '2016', 'v': '/year/2016'}, 
                         {'n': '2015', 'v': '/year/2015'}, 
                         {'n': '2014', 'v': '/year/2014'}, 
                         {'n': '2013', 'v': '/year/2013'}, 
                         {'n': '2012', 'v': '/year/2012'}, 
                         {'n': '2011', 'v': '/year/2011'}, 
                         {'n': '2000之前', 'v': '/year/lt|2000'}
                         ]
           },
          {'key': 'by', 
            'name': '排序', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '时间', 'v': '/by/time'}, 
                         {'n': '人气', 'v': '/by/hits'}, 
                         {'n': '评分', 'v': '/by/score'}
                          ]}], 
                          
    4: [
          {'key': 'id', 
            'name': '类型', 
            'value': [
                         {'n': '全部', 'v': '4'}, 
                         {'n': '大陆综艺', 'v': '31'},
                         {'n': '日韩综艺', 'v': '33'},
                         {'n': '欧美综艺', 'v': '34'},
                         {'n': '港台综艺', 'v': '32'}
                          ]
          },
          {'key': 'a', 
            'name': '地区', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '国产', 'v': '/area/%E5%9B%BD%E4%BA%A7'},
                         {'n': '日本', 'v': '/area/%E6%97%A5%E6%9C%AC'},
                         {'n': '欧美', 'v': '/area/%E6%AC%A7%E7%BE%8E'},
                         {'n': '其他', 'v': '/area/%E5%85%B6%E4%BB%96'}
                         ] 
           },
         {'key': 'y',            
            'name': '年代', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '2022', 'v': '/year/2022'}, 
                         {'n': '2021', 'v': '/year/2021'}, 
                         {'n': '2020', 'v': '/year/2020'}, 
                         {'n': '2019', 'v': '/year/2019'}, 
                         {'n': '2018', 'v': '/year/2018'}, 
                         {'n': '2017', 'v': '/year/2017'}, 
                         {'n': '2016', 'v': '/year/2016'}, 
                         {'n': '2015', 'v': '/year/2015'}, 
                         {'n': '2014', 'v': '/year/2014'}, 
                         {'n': '2013', 'v': '/year/2013'}, 
                         {'n': '2012', 'v': '/year/2012'}, 
                         {'n': '2011', 'v': '/year/2011'}, 
                         {'n': '2000之前', 'v': '/year/lt|2000'}
                         ]
           },
          {'key': 'by', 
            'name': '排序', 
            'value': [
                         {'n': '全部', 'v': ''}, 
                         {'n': '时间', 'v': '/by/time'}, 
                         {'n': '人气', 'v': '/by/hits'}, 
                         {'n': '评分', 'v': '/by/score'}
                          ]}]},
                          

filter_url:'http://www.lzizy9.com/index.php/vod/show{{fl.a}}{{fl.by}}/id/{{fl.id}}/page/fypage{{fl.y}}.html'

});